IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G2_EPWM11_CONTROLSS_G2_EPWM11.xml
	<register id="CONTROLSS_G2_EPWM11_ETSOCPS" acronym="CONTROLSS_G2_EPWM11_ETSOCPS" offset="0x160" width="16" description="Event-Trigger SOC Pre-Scale Register">
		<bitfield id="SOCBCNT2" width="4" begin="15" end="12" resetval="0x0" description="EPWMxSOCB Counter 2  When ETPS[SOCPSSEL] = 1, these bits indicate how many selected events have occurred:   0000: No events  0001: 1 event  0010: 2 events  0011: 3 events  0100: 4 events  ...  1111: 15 events" range="15 - 12" rwaccess="R"/> 
		<bitfield id="SOCBPRD2" width="4" begin="11" end="8" resetval="0x0" description="EPWMxSOCB Period 2 Select  When ETPS[SOCPSSEL] = 1, these bits select how many selected event need to occur before an SOCB pulse is generated:   0000: Disable counter  0001: Generate interrupt on SOCBCNT2 = 1 [first event]  0010: Generate interrupt on SOCBCNT2 = 2 [second event]  0011: Generate interrupt on SOCBCNT2 = 3 [third event]  0100: Generate interrupt on SOCBCNT2 = 4 [fourth event]  ...  1111: Generate interrupt on SOCBCNT2 = 15 [fifteenth event]" range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="SOCACNT2" width="4" begin="7" end="4" resetval="0x0" description="EPWMxSOCA Counter 2  When ETPS[SOCPSSEL] = 1, these bits indicate how many selected events have occurred:   0000: No events  0001: 1 event  0010: 2 events  0011: 3 events  0100: 4 events  ...  1111: 15 events" range="7 - 4" rwaccess="R"/> 
		<bitfield id="SOCAPRD2" width="4" begin="3" end="0" resetval="0x0" description="EPWMxSOCA Period 2 Select  When ETPS[SOCPSSEL] = 1, these bits select how many selected event need to occur before an SOCA pulse is generated:   0000: Disable counter  0001: Generate interrupt on SOCACNT2 = 1 [first event]  0010: Generate interrupt on SOCACNT2 = 2 [second event]  0011: Generate interrupt on SOCACNT2 = 3 [third event]  0100: Generate interrupt on SOCACNT2 = 4 [fourth event]  ...  1111: Generate interrupt on SOCACNT2 = 15 [fifteenth event]" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G2_EPWM11_ETCNTINITCTL" acronym="CONTROLSS_G2_EPWM11_ETCNTINITCTL" offset="0x164" width="16" description="Event-Trigger Counter Initialization Control Register">
		<bitfield id="SOCBINITEN" width="1" begin="15" end="15" resetval="0x0" description="EPWMxSOCB Counter 2 Initialization Enable   0: Has no effect.  1: Enable initialization of EPWMxSOCB counter with contents of ETCNTINIT[SOCBINIT] on a SYNC event or software force." range="15" rwaccess="R/W"/> 
		<bitfield id="SOCAINITEN" width="1" begin="14" end="14" resetval="0x0" description="EPWMxSOCA Counter 2 Initialization Enable   0: Has no effect.  1: Enable initialization of EPWMxSOCA counter with contents of ETCNTINIT[SOCAINIT] on a SYNC event or software force." range="14" rwaccess="R/W"/> 
		<bitfield id="INTINITEN" width="1" begin="13" end="13" resetval="0x0" description="EPWMxINT Counter 2 Initialization Enable   0: Has no effect.  1: Enable initialization of EPWMxINT counter 2 with contents of ETCNTINIT[INTINIT] on a SYNC event or software force." range="13" rwaccess="R/W"/> 
		<bitfield id="SOCBINITFRC" width="1" begin="12" end="12" resetval="0x0" description="EPWMxSOCB Counter 2 Initialization Force   0: Has no effect.  1: This bit forces the ET EPWMxSOCB counter to be initialized with the contents of ETCNTINIT[SOCBINIT]." range="12" rwaccess="R/W1TS"/> 
		<bitfield id="SOCAINITFRC" width="1" begin="11" end="11" resetval="0x0" description="EPWMxSOCA Counter 2 Initialization Force   0: Has no effect.  1: This bit forces the ET EPWMxSOCA counter to be initialized with the contents of ETCNTINIT[SOCAINIT]." range="11" rwaccess="R/W1TS"/> 
		<bitfield id="INTINITFRC" width="1" begin="10" end="10" resetval="0x0" description="EPWMxINT Counter 2 Initialization Force   0: Has no effect.  1: This bit forces the ET EPWMxINT counter to be initialized with the contents of ETCNTINIT[INTINIT]." range="10" rwaccess="R/W1TS"/>
	</register>
	<register id="CONTROLSS_G2_EPWM11_ETCNTINIT" acronym="CONTROLSS_G2_EPWM11_ETCNTINIT" offset="0x168" width="16" description="Event-Trigger Counter Initialization Register">
		<bitfield id="SOCBINIT" width="4" begin="11" end="8" resetval="0x0" description="EPWMxSOCB Counter 2 Initialization Bits  The ET EPWMxSOCB counter is initialized with the contents of this register on an ePWM SYNC event or a software force." range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="SOCAINIT" width="4" begin="7" end="4" resetval="0x0" description="EPWMxSOCA Counter 2 Initialization Bits  The ET EPWMxSOCA counter is initialized with the contents of this register on an ePWM SYNC event or a software force." range="7 - 4" rwaccess="R/W"/> 
		<bitfield id="INTINIT" width="4" begin="3" end="0" resetval="0x0" description="EPWMxINT Counter 2 Initialization Bits  The ET EPWMxINT counter is initialized with the contents of this register on an ePWM SYNC event or a software force." range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G2_EPWM11_ETINTMIXEN" acronym="CONTROLSS_G2_EPWM11_ETINTMIXEN" offset="0x16C" width="16" description="Event-Trigger Mixed INT Selection">
		<bitfield id="DCAEVT1" width="1" begin="10" end="10" resetval="0x0" description="Enable DCAEVT1.inter to the mixed ET interrupt trigger signal [ETINTMIX].    0: DCAEVT1.soc event is not enabled  1: Enable DCAEVT1.soc event" range="10" rwaccess="R/W"/> 
		<bitfield id="CDD" width="1" begin="9" end="9" resetval="0x0" description="Enable event time-base counter equal to CMPD when the timer is decrementing to the mixed ET interrupt trigger signal [ETINTMIX].    0: CMPD down-count match enable event is not enabled  1: Enable CMPD down-count match enable event" range="9" rwaccess="R/W"/> 
		<bitfield id="CDU" width="1" begin="8" end="8" resetval="0x0" description="Enable event time-base counter equal to CMPD when the timer is incrementing to the mixed ET interrupt trigger signal [ETINTMIX].    0: CMPD up-count match enable event is not enabled  1: Enable CMPD up-count match enable event" range="8" rwaccess="R/W"/> 
		<bitfield id="CCD" width="1" begin="7" end="7" resetval="0x0" description="Enable event time-base counter equal to CMPC when the timer is decrementing to the mixed ET interrupt trigger signal [ETINTMIX].    0: CMPC down-count match enable event is not enabled  1: Enable CMPC down-count match enable event" range="7" rwaccess="R/W"/> 
		<bitfield id="CCU" width="1" begin="6" end="6" resetval="0x0" description="Enable event time-base counter equal to CMPC when the timer is incrementing to the mixed ET interrupt trigger signal [ETINTMIX].    0: CMPC up-count match enable event is not enabled  1: Enable CMPC up-count match enable event" range="6" rwaccess="R/W"/> 
		<bitfield id="CBD" width="1" begin="5" end="5" resetval="0x0" description="Enable event time-base counter equal to CMPB when the timer is decrementing to the mixed ET interrupt trigger signal [ETINTMIX].    0: CMPB down-count match enable event is not enabled  1: Enable CMPB down-count match enable event" range="5" rwaccess="R/W"/> 
		<bitfield id="CBU" width="1" begin="4" end="4" resetval="0x0" description="Enable event time-base counter equal to CMPB when the timer is incrementing to the mixed ET interrupt trigger signal [ETINTMIX].    0: CMPB up-count match enable event is not enabled  1: Enable CMPB up-count match enable event" range="4" rwaccess="R/W"/> 
		<bitfield id="CAD" width="1" begin="3" end="3" resetval="0x0" description="Enable event time-base counter equal to CMPA when the timer is decrementing to the mixed ET interrupt trigger signal [ETINTMIX].    0: CMPA down-count match enable event is not enabled  1: Enable CMPA down-count match enable event" range="3" rwaccess="R/W"/> 
		<bitfield id="CAU" width="1" begin="2" end="2" resetval="0x0" description="Enable event time-base counter equal to CMPA when the timer is incrementing to the mixed ET interrupt trigger signal [ETINTMIX].    0: CMPA up-count match enable event is not enabled  1: Enable CMPA up-count match enable event" range="2" rwaccess="R/W"/> 
		<bitfield id="PRD" width="1" begin="1" end="1" resetval="0x1" description="Enable event time-base counter equal to period  [TBCTR = TBPRD] to the mixed ET interrupt trigger signal [ETINTMIX].    0: Period match event is not enabled  1: Enable period match event" range="1" rwaccess="R/W"/> 
		<bitfield id="ZRO" width="1" begin="0" end="0" resetval="0x1" description="Enable event time-base counter equal to zero [TBCTR = 0x00] to the mixed ET interrupt trigger signal [ETINTMIX].    0: Zero match event is not enabled  1: Enable zero match event" range="0" rwaccess="R/W"/>
	</register>
